import { useNavigation } from '@react-navigation/native';
import { View, Text, StyleSheet, TouchableOpacity, Image, ScrollView, Linking } from 'react-native'
import React from 'react'
import Icon from 'react-native-vector-icons/FontAwesome';

const SubArticle1 = () => {
    const navigation = useNavigation();

    const Article = () => {
        console.log('Article');
        navigation.navigate('Article');
    };
    const Credit = () => {
        const url = 'https://www.manarom.com/blog/article_thai.html';
        Linking.openURL(url);
    };
    return (
        <View style={styles.container}>
            <View style={styles.header}>
                <TouchableOpacity style={styles.button} onPress={Article}>
                    <Icon name="angle-left" size={35}></Icon>
                </TouchableOpacity>
                <Text style={styles.title}> Article </Text>
            </View>
            <Image source={require('../img/article1.png')} style={styles.image} />
            <ScrollView style={styles.card}>
                <Text style={styles.Textheader}>Burnout สภาวะหมดไฟจากการทำงาน คืออะไร</Text>
                <Text style={styles.TextContent}>เมื่อพูดถึงสภาวะหมดไฟจากการทำงาน หลายคนอาจมีมุมมองในทางลบ มองว่าสิ่งที่เป็นอยู่ไม่ใช่เรื่องจริงหรือว่าเป็นความไม่อดทนของผู้ที่เป็น
                    แต่ในความเป็นจริงแล้ว ไม่ว่าใครก็ตามเมื่อตกอยู่ในสภาวะเครียดเรื้อรัง ร่างกายและจิตใจของทุกคนสามารถเกิดความเหนื่อยล้า รู้สึกอ่อนแรงได้ ท้อได้
                    เป็นเรื่องปกติ สภาวะหมดไฟจากการทำงาน จึงเป็นภาวะความเครียดเรื้อรังที่เกิดขึ้นจากบรรยากาศของการทำงาน ส่งผลกระทบต่อสุขภาพกาย สุขภาพใจ
                    การเข้าสังคม ความสัมพันธ์กับคนรอบข้าง รวมไปถึงทำให้ประสิทธิภาพในการทำงานลดลง </Text>
                <Text style={styles.TextSubHeader}>สาเหตุของสภาวะ Burnout</Text>
                <Text style={styles.TextContent}>สาเหตุของภาวะหมดไฟจากการทำงาน แบ่งออกได้ 2 ปัจจัย
                    ปัจจัยแรก คือ ปัญหาที่เกิดขึ้นจากสถานที่ทำงาน ปัญหาที่พบได้บ่อยเป็นเรื่องของบรรยากาศในที่ทำงานที่มีความกดดัน มีความคาดหวังที่สูง ความขัดแย้งในสถานที่ทำงาน มีระบบดูแลที่ไม่ดี
                    ไม่ค่อยให้เกียรติผู้ร่วมงาน ภาวะเงินเดือนหรือผลตอบแทนที่ได้รับ ไม่เหมาะสมกับเนื้องานที่ได้ ก่อให้เกิดเป็นความรู้สึกที่ไม่พอใจ หรือจากตัวบุคคล ยกตัวอย่างเช่น บางคนมีความคาดหวังต่อตนเองสูง
                    มีความรับผิดชอบสูง จึงสร้างแรงกดดันตัวเองในการทำงานทุกอย่าง
                    ปัจจัยที่สอง คือ กลุ่มที่อยากช่วยเหลือ ยินดีรับงาน ช่วยเหลืองานทุกอย่าง โดยไม่เคยปฏิเสธงาน กลายเป็นการแบกรับภาระงานทุกอย่างไว้คนเดียว</Text>
                <Text style={styles.TextSubHeader}>สัญญาณเตือนสภาวะหมดไฟจากการทำงาน</Text>
                <Text style={styles.TextContent}>หากพูดถึงสัญญาณเบื้องต้นของภาวะหมดไฟ อย่างแรกที่เห็นได้ชัด เริ่มจากตัวของบุคคลก่อน คนที่อยู่ในสภาวะนั้นเริ่มรู้สึกเหนื่อยล้าง่าย ไม่ค่อยอยากลุกไปทำงาน
                    แต่ยังสามารถทำได้อยู่ เมื่อเป็นไปนาน ๆ ขึ้น สิ่่งที่อาจเกิดขึ้นได้ คือ ความรู้สึกว่าเราแตกแยก รู้สึกว่าไม่ได้เป็นส่วนหนึ่งของสถานที่ทำงาน รู้สึกไม่มีแรงจูงใจหรือเริ่มทำงานแล้วรู้สึกไม่สำเร็จเท่าที่ควร
                    และสภาวะต่อไปที่อาจเกิดขึ้นได้นอกจากการแยกตัวในที่ทำงานแล้ว คือ เริ่มแยกตัวจากคนอื่น อยากอยู่เงียบๆ คนเดียว รวมไปถึงสภาวะอารมณ์ก็เปลี่ยนแปลงไป บางคนรู้สึกท้อแท้ บางคนก็รู้สึกผิดหวังในตัวเอง
                    เมื่อความกังวลมากขึ้น รู้สึกว่าตนเองทำงานได้ไม่ดีเท่าเดิม ไม่ค่อยมีความสุขกับการทำงาน หรือบางคนอาจมีปัญหาเรื่องสุขภาพร่างกายตามมา เช่น อาการปวดท้องเหมือนเป็นโรคกระเพาะ ใจสั่น ใจเต้นแรง
                    มีปัญหาการนอนหลับ หรือบางคนอาจกระทบไปถึงความสัมพันธ์ทางเพศ</Text>
                <Text style={styles.TextSubHeader}>ผลกระทบเมื่อเกิดสภาวะ Burnout</Text>
                <Text style={styles.TextContent}>ผลกระทบที่เกิดขึ้นจากภาวะหมดไฟต่อการทำงาน เริ่มจากรู้สึกว่าไม่อยากไปทำงานเลย เกิดความรู้สึกว่าต้องแบกร่างขึ้นไปทำงาน หรือไปนั่งหน้าคอมพิวเตอร์เพื่อทำงานต่อ รู้สึกหนัก ความคิดไม่แล่น ประสิทธิภาพในการทำงานลดลง
                    ผลกระทบที่เกิดขึ้นต่อตัวบุคคล คือ ด้านสุขภาพทางร่างกาย เมื่อเกิดความเครียดเยอะขึ้น สะสมไว้ก็ก่อให้เกิดโรคหรืออาการต่างๆ อย่างเช่น โรคหัวใจ ใจเต้นแรง ปัญหาการนอนหลับ ความต้องการทางเพศที่เปลี่ยนไป ส่วนปัญหาทางด้านจิตใจก็เจอได้ บางคนเริ่มรู้สึกเบื่อ ท้อกับงานที่ต้องทำ
                    หากต้องทนต่อสภาพที่ไม่พึงพอใจนานๆ ก็อาจนำไปสู่ภาวะของโรคซึมเศร้าได้ มีความคิดวิตกกังวล รู้สึกว่าตัวเองไม่สามารถจัดการปัญหาที่เกิดขึ้นตรงหน้าได้ สูญเสียศรัทธาในตัวเอง สูญเสียศรัทธาที่เกิดขึ้นต่อคนรอบข้าง เพื่อนร่วมงานแยกตัวออกมา</Text>
                <Text style={styles.TextSubHeader}>Burnout ป้องกันได้</Text>
                <Text style={styles.TextContent}>การป้องกันก่อนเกิดภาวะหมดไฟจากการทำงาน สิ่งแรกที่แนะนำให้เริ่ม คือ สังเกตตัวเองอย่างสม่ำเสมอว่าตอนนี้รู้สึกพึงพอใจในการทำงานหรือไม่ ความสุขที่ได้จากการทำงานอยู่ในระดับไหน ถ้าเริ่มมีการเปลี่ยนแปลง
                    รู้สึกว่างานที่ทำสร้างแต่ความเหนื่อยล้า ไม่มีความสุข ถือเป็นสัญญาณเริ่มต้นที่ต้องค้นหาสาเหตุแล้ว ให้ลองสังเกตที่การทำงานก่อน บรรยากาศในที่ทำงานเปลี่ยนไปไหม ความกดดันที่เกิดจากงานเปลี่ยนไปหรือเปล่า หรือรู้สึกว่าภาระงานที่เกิดขึ้นเยอะเกินไป
                    งานนั้นสามารถแจกจ่ายให้กับเพื่อนร่วมงานคนอื่นได้หรือไม่ รวมถึงบรรยากาศในที่ทำงานก็สามารถพูดคุยกับทีมได้ว่า เราอยากพูดคุยหรือสื่อสารกันอย่างไร ต้องการให้แต่ละคนพูดถึงกันแบบไหนในที่ทำงาน บางครั้งก็สามารถคุยกับหัวหน้าทีมได้ว่าตอนนี้เกิดสภาวะอะไรขึ้น
                    อยากได้รับความช่วยเหลือจากคนรอบข้างอย่างไรบ้าง ส่วนปัจจัยที่สามารถแก้ไขได้ที่ตัวเราเอง เช่น การปรับลดความคาดหวังของตัวเองลง เพราะยิ่งคาดหวังมากว่างานจะประสบความสำเร็จก็เท่ากับยิ่งสร้างแรงกดดัน เราอาจแก้ไขได้โดยการแบ่งแยกย่อยเป้าหมายให้เป็นขั้นเล็กๆ
                    เพื่อให้ได้เห็นก้าวต่อไปที่ชัดเจนว่าควรก้าวไปที่ตรงไหน และสามารถหันมองย้อนกลับมาดูได้ว่าที่ผ่านมาเราทำอะไรสำเร็จไปแล้วบ้าง ซึ่งส่วนนี้ช่วยป้องกันการเกิดภาวะหมดไฟจากการทำงานได้</Text>
                <Text style={styles.TextSubHeader}>ภาวะหมดไฟจากการทำงานสัมพันธ์อย่างไรกับโรคซึมเศร้า</Text>
                <Text style={styles.TextContent}>ภาวะหมดไฟจากการทำงาน กับ ภาวะโรคซึมเศร้า เป็นคนละโรคกัน เพียงแต่ว่ามันมีจุดเชื่อมต่อกัน ภาวะหมดไฟจากการทำงานจะเกิดความรู้สึก ทุกข์ใจ ไม่มีความสุข เวลาที่จะเข้าไปทำงาน แต่เรายังสามารถคงความสุข
                    จากการทำกิจวัตรประจำวันอื่นๆ ทำในสิ่งที่ชอบได้ แต่ถ้าเรายังอยู่กับภาวะหมดไฟในการทำงานไปนานๆ ความเครียดที่เรื้อรังจะส่งผลทำให้ ความสุข จากด้านอื่นๆ ในชีวิตหายไปด้วย จากเดิมที่เราอาจจะสนุกเวลาที่ได้ไปท่องเที่ยว สนุกเวลาที่ได้ไปพักผ่อน ซื้อของ ชอปปิง
                    กลายเป็นว่าความสุขของตัวนี้ ถูกดึงออกไป จนกระทั่งไม่เหลือแรง ไม่เหลือความสุขอื่นๆ ในชีวิตเลย จะเรียกได้ว่าเข้าสู่ภาวะของโรคซึมเศร้าแล้ว </Text>
                <Text style={styles.TextSubHeader}>วิธีการดูแลตัวเองเบื้องต้น </Text>
                <Text style={styles.TextContent}>ในกรณีที่เกิดภาวะหมดไฟจากการทำงานแล้ว สิ่งที่ทำได้ทันที คือ การดึงตัวเองออกมาจากสภาวะการทำงานด้วยการขอลาหยุดงานหรือหาเวลาพักผ่อนให้กับตัวเองมากขึ้น แต่ต้องอย่าลืมเช็กด้วยว่าเมื่อเราหยุดพักผ่อนหรือหาเวลาทำกิจกรรมอื่นแล้ว
                    ใจของเรา ความคิดของเราและอารมณ์ของเรายังผูกอยู่กับการทำงานไหม หากยังรู้สึกหนักใจจากการทำงานอยู่ ยังมีความคิดวนเวียนอยู่กับงานที่จะเกิดขึ้นในอนาคต เมื่อเรารู้ทันในจุดนี้ก็ขอให้วางความคิดตรงนั้นลง แล้วจดจ่ออยู่กับเวลาของการพักผ่อน เวลาของตัวเราให้มากที่สุด
                    นอกจากการดึงตัวเองออกมาจากสถานที่ทำงานแล้ว การที่เราได้ปรึกษา ได้พูดคุยกับคนรอบข้าง ไม่ว่าจะเป็นครอบครัว เพื่อนคนสนิท หรือแม้กระทั่งเพื่อนที่ทำงานด้วยกันก็เป็นอีกทางเลือกหนึ่งที่ช่วยให้ดีขึ้นจากภาวะนี้
                    ในกรณีที่ได้ทำสิ่งที่แนะนำไปแล้ว แต่ยังรู้สึกเหนื่อยล้า ความหมดไฟยังคอยรบกวนใจอยู่ สิ่งที่ทำได้ต่อไป คือ การขอรับคำปรึกษาจากแพทย์ที่โรงพยาบาล ท้ายนี้ เวลาที่พบเจอคนที่มีสภาวะเหล่านี้ สิ่งที่อยากฝากไว้ก็คือ อย่าเพิ่งตัดสินเขา ลองเข้าไปคุย ลองเข้าไปถามว่าในตอนนี้เขาเป็นอย่างไรบ้าง
                    มีอะไรที่พอจะช่วยเหลือเขาได้บ้างไหม เพราะการที่เราทุกคนช่วยเหลือกัน มีน้ำใจต่อกัน และเห็นอกเห็นใจกันสามารถช่วยลดโอกาสเกิดสภาวะหมดไฟจากการทำงานลงได้</Text>
                <TouchableOpacity onPress={Credit}>
                    <Text style={styles.Website}>
                        Manarom Hospital
                    </Text>
                </TouchableOpacity>
            </ScrollView>
        </View>
    )
}

const styles = StyleSheet.create({
    container: {
        flex: 1,
        backgroundColor: 'white',
    },
    header: {
        flexDirection: 'row',
        alignItems: 'center',
        backgroundColor: 'White',
        // paddingHorizontal: 16,
        height: '12%',
    },
    button: {
        paddingLeft: '7%',
        marginTop: '15%',
    },
    title: {
        marginTop: '15%',
        justifyContent: 'center',
        alignItems: 'center',
        marginLeft: 'auto',
        marginRight: 'auto',
        fontSize: 25,
        fontWeight: 'bold',
    },
    image: {
        height: '30%',
        width: '100%',
        justifyContent: 'center',
        alignItems: 'center',
    },
    card: {
        height: '100%',
        width: '100%',
        backgroundColor: 'white',
        marginTop: -40,
        borderTopLeftRadius: 50,
        borderTopRightRadius: 50,
        shadowColor: 'black',
        shadowRadius: 50,
    },
    scrollview: {
        flex: 1,
        width: '100%',
    },
    Textheader: {
        fontSize: 23,
        fontWeight: 'bold',
        color: 'black',
        marginTop: 10,
        padding: 20,
    },
    TextContent: {
        padding: 20,
        fontSize: 17,
        marginTop: -15,
        lineHeight: 26,
        width: '100%'
    },
    TextSubHeader: {
        fontSize: 18,
        padding: 20,
        fontWeight: 'bold',
        marginTop: -20,
    },
    Website: {
        padding: 20,
        fontSize: 17,
        marginTop: -15,
        textDecorationLine: 'underline',
        textAlign: 'right',
    }
});
export default SubArticle1